files/collections/PMAK-68ba2ba23093ae0001f335c5-6ac1ba92c75a29f896e9dfcec3ef2ebefe/11-11-2025/8748389-TCA Customers.json

{"collection":{"info":{"_postman_id":"efea81bd-7077-4d70-8bc5-21caf39c1933","name":"TCA Customers","schema":"https://schema.getpostman.com/json/collection/v2.1.0/collection.json","createdAt":"2023-09-29T01:50:24.000Z","lastUpdatedBy":"8748389","uid":"8748389-efea81bd-7077-4d70-8bc5-21caf39c1933"},"item":[{"name":"Party","item":[{"name":"Create a Party Org","id":"810104ba-0816-4308-a4f2-e4e368fedec1","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"auth":{"type":"basic","basic":[{"key":"password","value":"{{Password}}","type":"string"},{"key":"username","value":"{{Username}}","type":"string"}]},"method":"POST","header":[{"key":"REST-Framework-Version","value":"7","type":"text"},{"key":"Content-Type","value":"application/json","type":"text"}],"body":{"mode":"raw","raw":"{\r\n    \"OrganizationName\": \"PATTERSON AGRICULTURE\",\r\n    \"PartyUsageCode\": \"EXTERNAL_LEGAL_ENTITY\",\r\n    \"CreatedByModule\": \"HZ_WS\"\r\n}","options":{"raw":{"language":"json"}}},"url":{"raw":"{{ServerName}}/crmRestApi/resources/latest/hubOrganizations","host":["{{ServerName}}"],"path":["crmRestApi","resources","latest","hubOrganizations"],"query":[{"key":"expand","value":"lines","disabled":true},{"key":"onlyData","value":"true","disabled":true},{"key":"limit","value":"100","disabled":true},{"key":"q","value":"RequisitionHeaderId=300000048657163","disabled":true},{"key":"","value":null,"type":"text","disabled":true}]}},"response":[],"uid":"8748389-810104ba-0816-4308-a4f2-e4e368fedec1"},{"name":"Create a Party Person","id":"35f4797f-e8fc-4587-a764-9ca4b63d0ddd","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"auth":{"type":"basic","basic":[{"key":"password","value":"{{Password}}","type":"string"},{"key":"username","value":"{{Username}}","type":"string"}]},"method":"POST","header":[{"key":"REST-Framework-Version","value":"7","type":"text"},{"key":"Content-Type","value":"application/json","type":"text"}],"body":{"mode":"raw","raw":"{\r\n    \"FirstName\": \"Owen\",\r\n    \"MiddleName\": \"John\",\r\n    \"LastName\": \"Young\",\r\n    \"UniqueNameSuffix\": \"Phd\",\r\n    \"PartyUsageCode\": \"PARTY_OF_INTEREST\",\r\n    \"CreatedByModule\": \"HZ_WS\"\r\n}","options":{"raw":{"language":"json"}}},"url":{"raw":"{{ServerName}}/crmRestApi/resources/latest/hubPersons","host":["{{ServerName}}"],"path":["crmRestApi","resources","latest","hubPersons"],"query":[{"key":"expand","value":"lines","disabled":true},{"key":"onlyData","value":"true","disabled":true},{"key":"limit","value":"100","disabled":true},{"key":"q","value":"RequisitionHeaderId=300000048657163","disabled":true},{"key":"","value":null,"type":"text","disabled":true}]}},"response":[],"uid":"8748389-35f4797f-e8fc-4587-a764-9ca4b63d0ddd"}],"id":"1330a2ee-f694-47d8-98c1-b082d9fe19e1","uid":"8748389-1330a2ee-f694-47d8-98c1-b082d9fe19e1"},{"name":"Accounts","item":[{"name":"Create Customer Account Org","id":"fe7b45e9-8427-476f-84f5-9411a06f9834","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"auth":{"type":"basic","basic":[{"key":"password","value":"{{Password}}","type":"string"},{"key":"username","value":"{{Username}}","type":"string"}]},"method":"POST","header":[{"key":"REST-Framework-Version","value":"7","type":"text"},{"key":"Content-Type","value":"text/xml","type":"text"}],"body":{"mode":"raw","raw":"<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:typ=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/\" xmlns:cus=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/\" xmlns:cus1=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountContactRole/\" xmlns:par=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/\" xmlns:sour=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/sourceSystemRef/\" xmlns:cus2=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountContact/\" xmlns:cus3=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountRel/\" xmlns:cus4=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountSiteUse/\" xmlns:cus5=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountSite/\" xmlns:cus6=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccount/\">\r\n    <soapenv:Header/>\r\n    <soapenv:Body>\r\n        <typ:mergeCustomerAccount>\r\n            <typ:customerAccount>\r\n                <cus:PartyId>300000262828579</cus:PartyId>\r\n                <cus:CreatedByModule>HZ_WS</cus:CreatedByModule>\r\n                <cus:AccountName>PATTERSON AGRICULTURE</cus:AccountName>\r\n            </typ:customerAccount>\r\n        </typ:mergeCustomerAccount>\r\n    </soapenv:Body>\r\n</soapenv:Envelope>","options":{"raw":{"language":"xml"}}},"url":{"raw":"{{ServerName}}/crmService/CustomerAccountService","host":["{{ServerName}}"],"path":["crmService","CustomerAccountService"],"query":[{"key":"expand","value":"lines","disabled":true},{"key":"onlyData","value":"true","disabled":true},{"key":"limit","value":"100","disabled":true},{"key":"q","value":"RequisitionHeaderId=300000048657163","disabled":true},{"key":"","value":null,"type":"text","disabled":true}]}},"response":[],"uid":"8748389-fe7b45e9-8427-476f-84f5-9411a06f9834"},{"name":"Create Customer Account Person","id":"0db0759b-6a05-4acd-9a33-f1b0f03c2f13","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"auth":{"type":"basic","basic":[{"key":"password","value":"{{Password}}","type":"string"},{"key":"username","value":"{{Username}}","type":"string"}]},"method":"POST","header":[{"key":"REST-Framework-Version","value":"7","type":"text"},{"key":"Content-Type","value":"text/xml","type":"text"}],"body":{"mode":"raw","raw":"<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:typ=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/\" xmlns:cus=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/\" xmlns:cus1=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountContactRole/\" xmlns:par=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/\" xmlns:sour=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/sourceSystemRef/\" xmlns:cus2=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountContact/\" xmlns:cus3=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountRel/\" xmlns:cus4=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountSiteUse/\" xmlns:cus5=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountSite/\" xmlns:cus6=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccount/\">\r\n    <soapenv:Header/>\r\n    <soapenv:Body>\r\n        <typ:mergeCustomerAccount>\r\n            <typ:customerAccount>\r\n                <cus:PartyId>300000263114432</cus:PartyId>\r\n                <cus:CreatedByModule>HZ_WS</cus:CreatedByModule>\r\n                <cus:AccountName>OWEN JOHN YOUNG ACCOUNT</cus:AccountName>\r\n            </typ:customerAccount>\r\n        </typ:mergeCustomerAccount>\r\n    </soapenv:Body>\r\n</soapenv:Envelope>","options":{"raw":{"language":"xml"}}},"url":{"raw":"{{ServerName}}/crmService/CustomerAccountService","host":["{{ServerName}}"],"path":["crmService","CustomerAccountService"],"query":[{"key":"expand","value":"lines","disabled":true},{"key":"onlyData","value":"true","disabled":true},{"key":"limit","value":"100","disabled":true},{"key":"q","value":"RequisitionHeaderId=300000048657163","disabled":true},{"key":"","value":null,"type":"text","disabled":true}]}},"response":[],"uid":"8748389-0db0759b-6a05-4acd-9a33-f1b0f03c2f13"}],"id":"ae836b63-2db6-41d5-92e7-1fc597d1e179","uid":"8748389-ae836b63-2db6-41d5-92e7-1fc597d1e179"},{"name":"Addresses","item":[{"name":"Create Address2 - Person","id":"e8edb17f-6078-4962-866a-1a21ae7d21ca","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"auth":{"type":"basic","basic":[{"key":"password","value":"{{Password}}","type":"string"},{"key":"username","value":"{{Username}}","type":"string"}]},"method":"POST","header":[{"key":"REST-Framework-Version","value":"7","type":"text"},{"key":"Content-Type","value":"application/vnd.oracle.adf.resourceitem+json","type":"text"}],"body":{"mode":"raw","raw":"{ \r\n    \"Address1\": \"199 STERLING PL\",\r\n    \"Address2\": \"APT D\",\r\n    \"City\": \"BROOKLYN\",\r\n    \"State\": \"New York\",\r\n    \"Country\": \"US\",\r\n    \"PostalCode\": \"11217-3324\"\r\n}","options":{"raw":{"language":"xml"}}},"url":{"raw":"{{ServerName}}/crmRestApi/resources/latest/hubPersons/979787/child/Address","host":["{{ServerName}}"],"path":["crmRestApi","resources","latest","hubPersons","979787","child","Address"],"query":[{"key":"expand","value":"lines","disabled":true},{"key":"onlyData","value":"true","disabled":true},{"key":"limit","value":"100","disabled":true},{"key":"q","value":"RequisitionHeaderId=300000048657163","disabled":true},{"key":"","value":null,"type":"text","disabled":true}]}},"response":[],"uid":"8748389-e8edb17f-6078-4962-866a-1a21ae7d21ca"},{"name":"Create Address - Person","id":"45416476-0a7f-4913-9f2d-ea9c557af3d5","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"auth":{"type":"basic","basic":[{"key":"password","value":"{{Password}}","type":"string"},{"key":"username","value":"{{Username}}","type":"string"}]},"method":"POST","header":[{"key":"REST-Framework-Version","value":"7","type":"text"},{"key":"Content-Type","value":"application/vnd.oracle.adf.resourceitem+json","type":"text"}],"body":{"mode":"raw","raw":"{ \r\n    \"Address1\": \"259 E\",\r\n    \"Address2\": \"APT D\",\r\n    \"City\": \"LITTLE ROCK\",\r\n    \"State\": \"Arkansas\",\r\n    \"Country\": \"US\",\r\n    \"PostalCode\": \"72206-3293\"\r\n}","options":{"raw":{"language":"xml"}}},"url":{"raw":"{{ServerName}}/crmRestApi/resources/latest/hubPersons/979787/child/Address","host":["{{ServerName}}"],"path":["crmRestApi","resources","latest","hubPersons","979787","child","Address"],"query":[{"key":"expand","value":"lines","disabled":true},{"key":"onlyData","value":"true","disabled":true},{"key":"limit","value":"100","disabled":true},{"key":"q","value":"RequisitionHeaderId=300000048657163","disabled":true},{"key":"","value":null,"type":"text","disabled":true}]}},"response":[],"uid":"8748389-45416476-0a7f-4913-9f2d-ea9c557af3d5"}],"id":"30991d30-1396-49ff-9963-3455043b7e35","uid":"8748389-30991d30-1396-49ff-9963-3455043b7e35"},{"name":"Account Site","item":[{"name":"Create Account Site - Person","id":"763f80ef-5936-4271-96f1-9928390ebdfd","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"auth":{"type":"basic","basic":[{"key":"password","value":"{{Password}}","type":"string"},{"key":"username","value":"{{Username}}","type":"string"}]},"method":"POST","header":[{"key":"REST-Framework-Version","value":"7","type":"text"},{"key":"Content-Type","value":"text/xml","type":"text"}],"body":{"mode":"raw","raw":"<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <soap:Body>\r\n        <ns1:mergeCustomerAccount xmlns:ns1=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/\">\r\n            <ns1:customerAccount xmlns:ns2=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/\">\r\n                <ns2:CustomerAccountId>300000263114435</ns2:CustomerAccountId>\r\n                <ns2:CustomerAccountSite>\r\n                    <ns2:PartySiteId>300000263114438</ns2:PartySiteId>\r\n                    <ns2:CreatedByModule>HZ_WS</ns2:CreatedByModule>\r\n                    <ns2:SetId>300000047280442</ns2:SetId>\r\n                </ns2:CustomerAccountSite>\r\n            </ns1:customerAccount>\r\n        </ns1:mergeCustomerAccount>\r\n    </soap:Body>\r\n</soap:Envelope>","options":{"raw":{"language":"xml"}}},"url":{"raw":"{{ServerName}}/crmService/CustomerAccountService","host":["{{ServerName}}"],"path":["crmService","CustomerAccountService"],"query":[{"key":"expand","value":"lines","disabled":true},{"key":"onlyData","value":"true","disabled":true},{"key":"limit","value":"100","disabled":true},{"key":"q","value":"RequisitionHeaderId=300000048657163","disabled":true},{"key":"","value":null,"type":"text","disabled":true}]}},"response":[],"uid":"8748389-763f80ef-5936-4271-96f1-9928390ebdfd"},{"name":"Create Account Site2 - Person","id":"3b1ada36-1f03-4978-b2cb-2c3dffca3e54","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"auth":{"type":"basic","basic":[{"key":"password","value":"{{Password}}","type":"string"},{"key":"username","value":"{{Username}}","type":"string"}]},"method":"POST","header":[{"key":"REST-Framework-Version","value":"7","type":"text"},{"key":"Content-Type","value":"text/xml","type":"text"}],"body":{"mode":"raw","raw":"<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <soap:Body>\r\n        <ns1:mergeCustomerAccount xmlns:ns1=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/\">\r\n            <ns1:customerAccount xmlns:ns2=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/\">\r\n                <ns2:CustomerAccountId>300000263114435</ns2:CustomerAccountId>\r\n                <ns2:CustomerAccountSite>\r\n                    <ns2:PartySiteId>300000263114503</ns2:PartySiteId>\r\n                    <ns2:CreatedByModule>HZ_WS</ns2:CreatedByModule>\r\n                    <ns2:SetId>300000047280442</ns2:SetId>\r\n                </ns2:CustomerAccountSite>\r\n            </ns1:customerAccount>\r\n        </ns1:mergeCustomerAccount>\r\n    </soap:Body>\r\n</soap:Envelope>","options":{"raw":{"language":"xml"}}},"url":{"raw":"{{ServerName}}/crmService/CustomerAccountService","host":["{{ServerName}}"],"path":["crmService","CustomerAccountService"],"query":[{"key":"expand","value":"lines","disabled":true},{"key":"onlyData","value":"true","disabled":true},{"key":"limit","value":"100","disabled":true},{"key":"q","value":"RequisitionHeaderId=300000048657163","disabled":true},{"key":"","value":null,"type":"text","disabled":true}]}},"response":[],"uid":"8748389-3b1ada36-1f03-4978-b2cb-2c3dffca3e54"}],"id":"fcec285c-f03d-4330-9a20-5f7bc63f39ea","uid":"8748389-fcec285c-f03d-4330-9a20-5f7bc63f39ea"},{"name":"Account Site Purpose","item":[{"name":"Create Account Site Purpose - Person","id":"9638b3bf-13fc-463f-ac0c-5c90a371942a","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"auth":{"type":"basic","basic":[{"key":"password","value":"{{Password}}","type":"string"},{"key":"username","value":"{{Username}}","type":"string"}]},"method":"POST","header":[{"key":"REST-Framework-Version","value":"7","type":"text"},{"key":"Content-Type","value":"text/xml","type":"text"}],"body":{"mode":"raw","raw":"<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:typ=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/\" xmlns:cus=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/\" xmlns:cus1=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountContactRole/\" xmlns:par=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/\" xmlns:sour=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/sourceSystemRef/\" xmlns:cus2=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountContact/\" xmlns:cus3=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountRel/\" xmlns:cus4=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountSiteUse/\" xmlns:cus5=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountSite/\" xmlns:cus6=\"http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccount/\">\r\n    <soapenv:Header/>\r\n    <soapenv:Body>\r\n        <typ:mergeCustomerAccount>\r\n            <typ:customerAccount>\r\n                <cus:CustomerAccountId>300000263114435</cus:CustomerAccountId>\r\n                <cus:CustomerAccountSite>\r\n                    <cus:CustomerAccountSiteId>300000263114502</cus:CustomerAccountSiteId>\r\n                    <cus:CustomerAccountId>300000263114435</cus:CustomerAccountId>\r\n                    <cus:CustomerAccountSiteUse>\r\n                        <cus:SiteUseCode>BILL_TO</cus:SiteUseCode>\r\n                        <cus:CreatedByModule>HZ_WS</cus:CreatedByModule>\r\n                    </cus:CustomerAccountSiteUse>\r\n                    <cus:CustomerAccountSiteUse>\r\n                        <cus:SiteUseCode>SHIP_TO</cus:SiteUseCode>\r\n                        <cus:CreatedByModule>HZ_WS</cus:CreatedByModule>\r\n                    </cus:CustomerAccountSiteUse>\r\n                </cus:CustomerAccountSite>\r\n            </typ:customerAccount>\r\n        </typ:mergeCustomerAccount>\r\n    </soapenv:Body>\r\n</soapenv:Envelope>","options":{"raw":{"language":"xml"}}},"url":{"raw":"{{ServerName}}/crmService/CustomerAccountService","host":["{{ServerName}}"],"path":["crmService","CustomerAccountService"],"query":[{"key":"expand","value":"lines","disabled":true},{"key":"onlyData","value":"true","disabled":true},{"key":"limit","value":"100","disabled":true},{"key":"q","value":"RequisitionHeaderId=300000048657163","disabled":true},{"key":"","value":null,"type":"text","disabled":true}]}},"response":[],"uid":"8748389-9638b3bf-13fc-463f-ac0c-5c90a371942a"}],"id":"1c5d9471-2b99-4f5e-8673-41ca09a6b941","uid":"8748389-1c5d9471-2b99-4f5e-8673-41ca09a6b941"}]}}